zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_mdf.h
/* Out-off limit detection functions  *****************************************/
/** @addtogroup MDF_Exported_Functions_Group5
  * @{
  */
HAL_StatusTypeDef HAL_MDF_OldStart(MDF_HandleTypeDef *hmdf, const MDF_OldConfigTypeDef *pOldConfig);
HAL_StatusTypeDef HAL_MDF_PollForOld(MDF_HandleTypeDef *hmdf, uint32_t Timeout, uint32_t *pThresholdInfo);
HAL_StatusTypeDef HAL_MDF_OldStop(MDF_HandleTypeDef *hmdf);
HAL_StatusTypeDef HAL_MDF_OldStart_IT(MDF_HandleTypeDef *hmdf, const MDF_OldConfigTypeDef *pOldConfig);
HAL_StatusTypeDef HAL_MDF_OldStop_IT(MDF_HandleTypeDef *hmdf);
void              HAL_MDF_OldCallback(MDF_HandleTypeDef *hmdf, uint32_t ThresholdInfo);
/**
  * @}
  */

/* Generic functions  *********************************************************/
/** @addtogroup MDF_Exported_Functions_Group6
  * @{
  */
void                 HAL_MDF_IRQHandler(MDF_HandleTypeDef *hmdf);
void                 HAL_MDF_ErrorCallback(MDF_HandleTypeDef *hmdf);
HAL_MDF_StateTypeDef HAL_MDF_GetState(const MDF_HandleTypeDef *hmdf);
uint32_t             HAL_MDF_GetError(const MDF_HandleTypeDef *hmdf);
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup MDF_Private_Macros  MDF Private Macros
  * @{
  */
#define IS_MDF_INSTANCE(PARAM) (((PARAM) == MDF1_Filter0) || \
                                ((PARAM) == MDF1_Filter1) || \
                                ((PARAM) == MDF1_Filter2) || \
                                ((PARAM) == MDF1_Filter3) || \
                                ((PARAM) == MDF1_Filter4) || \
                                ((PARAM) == MDF1_Filter5))

#define IS_ADF_INSTANCE(PARAM) ((PARAM) == ADF1_Filter0)

#define IS_MDF_FILTER_BITSTREAM(PARAM) (((PARAM) == MDF_BITSTREAM0_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM0_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM1_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM1_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM2_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM2_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM3_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM3_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM4_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM4_FALLING) || \
                                        ((PARAM) == MDF_BITSTREAM5_RISING)  || \
                                        ((PARAM) == MDF_BITSTREAM5_FALLING))

#define IS_MDF_INTERLEAVED_FILTERS(PARAM) ((PARAM) <= 5U)

#define IS_MDF_PROC_CLOCK_DIVIDER(PARAM) ((1U <= (PARAM)) && ((PARAM) <= 128U))

#define IS_MDF_OUTPUT_CLOCK_PINS(PARAM) (((PARAM) == MDF_OUTPUT_CLOCK_0) || \
                                         ((PARAM) == MDF_OUTPUT_CLOCK_1) || \
                                         ((PARAM) == MDF_OUTPUT_CLOCK_ALL))

#define IS_MDF_OUTPUT_CLOCK_DIVIDER(PARAM) ((1U <= (PARAM)) && ((PARAM) <= 16U))

#define IS_MDF_OUTPUT_CLOCK_TRIGGER_SOURCE(PARAM) (((PARAM) == MDF_CLOCK_TRIG_TRGO)       || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM1_TRGO)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM1_TRGO2) || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM8_TRGO)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM8_TRGO2) || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM3_TRGO)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM4_TRGO)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM16_OC1)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM6_TRGO)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_TIM7_TRGO)  || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_SAD_DET)    || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_EXTI11)     || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_EXTI15)     || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_LPTIM1_OUT) || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_SAD_TRGO))

#define IS_ADF_OUTPUT_CLOCK_TRIGGER_SOURCE(PARAM) (((PARAM) == MDF_CLOCK_TRIG_TRGO)       || \
                                                   ((PARAM) == MDF_CLOCK_TRIG_EXTI15))

#define IS_MDF_OUTPUT_CLOCK_TRIGGER_EDGE(PARAM) (((PARAM) == MDF_CLOCK_TRIG_RISING_EDGE) || \
                                                 ((PARAM) == MDF_CLOCK_TRIG_FALLING_EDGE))

#define IS_MDF_SITF_MODE(PARAM) (((PARAM) == MDF_SITF_LF_MASTER_SPI_MODE)      || \
                                 ((PARAM) == MDF_SITF_NORMAL_SPI_MODE)         || \
                                 ((PARAM) == MDF_SITF_MANCHESTER_FALLING_MODE) || \
                                 ((PARAM) == MDF_SITF_MANCHESTER_RISING_MODE))

#define IS_MDF_SITF_CLOCK_SOURCE(PARAM) (((PARAM) == MDF_SITF_CCK0_SOURCE) || \
                                         ((PARAM) == MDF_SITF_CCK1_SOURCE) || \
                                         ((PARAM) == MDF_SITF_CKI_SOURCE))

#define IS_MDF_SITF_THRESHOLD(PARAM) ((4U <= (PARAM)) && ((PARAM) <= 31U))

#define IS_MDF_CIC_MODE(PARAM) (((PARAM) == MDF_TWO_FILTERS_MCIC_FASTSINC) || \
                                ((PARAM) == MDF_TWO_FILTERS_MCIC_SINC1)    || \
                                ((PARAM) == MDF_TWO_FILTERS_MCIC_SINC2)    || \
                                ((PARAM) == MDF_TWO_FILTERS_MCIC_SINC3)    || \
                                ((PARAM) == MDF_ONE_FILTER_SINC4)          || \
                                ((PARAM) == MDF_ONE_FILTER_SINC5))

#define IS_ADF_CIC_MODE(PARAM) (((PARAM) == MDF_ONE_FILTER_SINC4) || \
                                ((PARAM) == MDF_ONE_FILTER_SINC5))

